import { colorsDecimal } from '@/constants';
import {
  ButtonBuilder,
  ButtonStyle,
  ButtonInteraction,
  EmbedBuilder,
  MessageFlags,
} from 'discord.js';

export default {
  id: 'infoOrder',
  data: new ButtonBuilder()
    .setCustomId('infoOrder')
    .setLabel('Процес замовлення')
    .setEmoji('📝')
    .setStyle(ButtonStyle.Secondary),

  async run(i: ButtonInteraction) {
    return await i.reply({
      embeds: [
        new EmbedBuilder()
          .setTitle('📝 Як працює система замовлень на сервері?')
          .addFields([
            {
              name: 'Крок 0 — створення кабінету',
              value:
                'Натисни кнопку **«👤 Створити кабінет»** і заповни анкету (ПІБ, факультет, телеграм, тощо). Після підтвердження бот відкриє для тебе особистий канал-кабінет.',
              inline: false,
            },
            {
              name: 'Крок 1 — нове замовлення',
              value:
                'У своєму кабінеті натисни **«📥 Створити замовлення»** (або **«✏️ Редагувати дані»**, якщо потрібно підправити профіль)',
              inline: false,
            },
            {
              name: 'Крок 2 — заповнення форми (5 етапів)',
              value:
                '1. Оберіть семестр із випадайки.\n' +
                '2. Виберіть потрібний предмет.\n' +
                '3. Вкажіть робти, які б ви хотіли замовити з випливаючого списку.\n' +
                '4. Поле «Опис» – це додаткова інформація, яку ви можете вказати для виконавця.\n' +
                '***‼️УВАГА*** на заповнення кожного етапу дається 1 хвилина. Якщо ви не встигли заповнити форму, почність спробу знову.',
              inline: false,
            },
            {
              name: 'Крок 3 — створення Thread-каналу для замовлення',
              value:
                'Після підтвердження бот створить **Thread-канал** з усією інформацією по замовленню та його статусом (⏳ Очікує виконавця → 🛠️ У роботі → 💸 Очікує оплату → ✅ Готово). Тут же відбувається комунікація з персоналом.',
              inline: false,
            },
            {
              name: 'Крок 4 — оновлення даних',
              value:
                'Якщо вас змістили в списку групи, або ви неправильно вказали дані — повернись до кабінету і натисни **«✏️ Редагувати дані»**. Бот оновить профіль без втрати поточних замовлень.',
              inline: false,
            },
          ])
          .setColor(colorsDecimal.Info),
      ],
      flags: MessageFlags.Ephemeral,
    });
  },
};
