export const messages = {
  Success: {
    Command: {
      Run: 'Команду успішно виконано.',
      Reload: 'Команду успішно перезавантажено.',
    },
    Component: {
      Run: 'Компонент успішно виконано.',
      Reload: 'Компонент успішно перезавантажено.',
    },
  },
  Error: {
    Command: {
      NotFound: 'Команду не знайдено.',
      Run: 'Під час виконання команди сталася помилка.',
      Reload: 'Під час перезавантаження команди сталася помилка.',
    },
    Component: {
      NotFound: 'Компонент не знайдено.',
      Run: 'Під час виконання компонента сталася помилка.',
      Reload: 'Під час перезавантаження компонента сталася помилка.',
    },
  },
  Warning: {
    Command: {
      NotFound: 'Команду не знайдено. Перевірте назву команди.',
      Reload: 'Не вдалося перезавантажити команду. Перевірте файл команди.',
    },
    Component: {
      NotFound: 'Компонент не знайдено. Перевірте ID компонента.',
      Reload: 'Не вдалося перезавантажити компонент. Перевірте файл компонента.',
    },
  },
  Info: {
    Command: {
      Reload: 'Перезавантаження команди...',
    },
    Component: {
      Reload: 'Перезавантаження компонента...',
    },
  },
  DevOnly: 'Ця команда/компонент доступна лише для розробників. 👷',
} as const;
